Q1. List any five functions of the pandas library with execution.

In [3]:
#importing panas labries
import pandas as pd

In [3]:
# Create a DataFrame
data = {'Name': ['John', 'Emma', 'Michael', 'Sophia', 'Daniel'],
        'City': ['New York', 'London', 'Paris', 'Sydney', 'Tokyo'],
        'Salary': [5000, 6000, 4500, 5500, 4000]}
df = pd.DataFrame(data)

# Group data by 'City' and calculate the average salary
grouped_df = df.groupby('City')['Salary'].mean()

# Display the grouped DataFrame
print(grouped_df)

City
London      6000.0
New York    5000.0
Paris       4500.0
Sydney      5500.0
Tokyo       4000.0
Name: Salary, dtype: float64

In [5]:
df1 = pd.read_csv("https://media.githubusercontent.com/media/datablist/sample-csv-files/main/files/organizations/organizations-100.csv")

In [6]:
df.describe()

            Salary
count     5.000000
mean   5000.000000
std     790.569415
min    4000.000000
25%    4500.000000
50%    5000.000000
75%    5500.000000
max    6000.000000

In [7]:
df.head()

      Name      City  Salary
0     John  New York    5000
1     Emma    London    6000
2  Michael     Paris    4500
3   Sophia    Sydney    5500
4   Daniel     Tokyo    4000

In [8]:
df.tail()

      Name      City  Salary
0     John  New York    5000
1     Emma    London    6000
2  Michael     Paris    4500
3   Sophia    Sydney    5500
4   Daniel     Tokyo    4000

In [11]:
df.to_csv('new_data.csv',index = False)

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [13]:
import pandas as pd

def reindex_dataframe(df):
    new_index = pd.RangeIndex(start=1, stop=2*len(df)+1, step=2)
    df = df.reset_index(drop=True)
    df.index = new_index
    return df

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [30]:
#creting dataframe 
df = pd.DataFrame({'values':[10, 20, 30, 40, 50]})

In [42]:
def sum_three_values(df):
    total = df.iloc[0:3]['values'].sum()
    return total

In [43]:
sum_three_values(df)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [45]:
#create a function word coount
def word_count(df):
    df['Word_Count'] = df['Text'].apply(lambda x: len(str(x).split(" ")))
    return df

In [46]:
#creating a dataframe using function
df = pd.DataFrame({'Text':['This is a test', 'Another test', 'Yet another test']})

In [47]:
#call a function
word_count(df)

               Text  Word_Count
0    This is a test           4
1      Another test           2
2  Yet another test           3

Q5. How are DataFrame.size() and DataFrame.shape() different?

The size() method returns the total number of elements in the DataFrame. It is equivalent to the product of the number of rows and columns in the DataFrame.

On the other hand, the shape() method returns a tuple representing the dimensionality of the DataFrame. The first element of the tuple is the number of rows and the second element is the number of columns.

For example, if you have a DataFrame with 10 rows and 5 columns, calling size() will return 50 (10 * 5), while calling shape() will return (10, 5).

Q6. Which function of pandas do we use to read an excel file?

pd.read_excel

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [54]:
#creating a dataframe
df = pd.DataFrame({'Email':['john.doe@example.com','john.doe@example.com']})

In [59]:
#creating a funcion extract username from email
def exract_email(x):
    return x.split('@')[0]

In [63]:
#test the function
df['username'] = df['Email'].apply(exract_email)

In [64]:
df

                  Email  username
0  john.doe@example.com  john.doe
1  john.doe@example.com  john.doe

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [4]:
#creating a dataframe
df = pd.DataFrame({'A':[1,2,4,8,9],
                   'B':[2,6,7,9,8],
                   'C':[7,8,9,5,3]})

In [7]:
selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
print(selected_rows)

   A  B  C
3  8  9  5
4  9  8  3

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [30]:
df = pd.DataFrame({'Values': [23,45,67,89,1,2,35]})

In [ ]:
#creating a function calculate the mean, median, and standard deviation


def calculate_mean_median_std(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std = df['Values'].std()
    return mean, median, std

In [32]:
mean, median, std = calculate_mean_median_std(df)
print("Mean:", mean)
print("Median:", median)
print("Standard Deviation:", std)

Mean: 37.42857142857143
Median: 35.0
Standard Deviation: 32.628500541996225

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [41]:
def calulate_moving_avg(df):
    df['Moving_avg'] = df['sales'].rolling(window = 7).mean()
    return df

In [52]:
df = pd.DataFrame({'sales':[23,45,67,89,12,90,80],
                  'Dates':['2023-06-01','2023-06-01','2023-06-01','2023-06-01','2023-06-01','2023-06-01','2023-06-01']})

In [53]:
calulate_moving_avg(df)

   sales       Dates  Moving_avg
0     23  2023-06-01         NaN
1     45  2023-06-01         NaN
2     67  2023-06-01         NaN
3     89  2023-06-01         NaN
4     12  2023-06-01         NaN
5     90  2023-06-01         NaN
6     80  2023-06-01        58.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [67]:
df = pd.DataFrame({'Dates':['2023-1-1','2023-1-2','2023-1-3','2023-1-4','2023-1-5']})

In [65]:
#creating a function extract return  weekday column dates
def weekday(df):
    df['Dates'] = pd.to_datetime(df['Dates'])
    df['Weekday'] = df['Dates'].dt.day_name()
    return df

In [68]:
weekday(df)

       Dates    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [69]:
date = pd.date_range(start = '2023-01-01',end = '2023-01-31')

In [70]:
df = pd.D

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31'],
              dtype='datetime64[ns]', freq='D')